БухЭксп/Catalogs/CW_КонтактыеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_КонтактыеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Comment>Уволен (не действует)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_КонтактыеЛица/Forms/ФормаВыбораКонтактногоЛица/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент",Контрагент);
	Если (НЕ ЗначениеЗаполнено(Контрагент)) Тогда
		Если (Параметры.Свойство("Отбор")) Тогда			
			Параметры.Отбор.Свойство("Владелец",Контрагент);			
		КонецЕсли; 	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Контактные лица " + "(" + Контрагент + ")";	
	КонецЕсли;	
	
	//Если (НЕ ЗначениеЗаполнено(Контрагент)) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли; 
	// --- 
	Если (ЗначениеЗаполнено(Контрагент)) Тогда
		_СформироватьДерево();	
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СформироватьДерево()
	
	СохранитьВидДерева();
	_СформироватьДерево();
	ВосстановитьВидДерева();	
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьДерево()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КонтактыеЛица.Ссылка,
	               |	CW_КонтактыеЛица.Родитель,
	               |	CW_КонтактыеЛица.Наименование,
	               |	0 КАК Уровень,
	               |	CW_КонтактыеЛица.ЭтоГруппа,
	               |	CW_КонтактыеЛица.Должность,
	               |	CW_КонтактыеЛица.Неактивный,
	               |	CW_КонтактыеЛица.Комментарий
	               |ИЗ
	               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
	               |ГДЕ
	               |	CW_КонтактыеЛица.Владелец = &Владелец
	               |	И CW_КонтактыеЛица.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("СтрокаСформирована",Новый ОписаниеТипов("Булево"));
	
	УровниГрупп = Новый Соответствие;
	Для каждого Стр Из ТЗ Цикл
		
		Если (Стр.ЭтоГруппа) Тогда
			
			УровниГрупп.Вставить(Стр.Ссылка,_ОпределитьУровеньГруппы(Стр.Ссылка,УровниГрупп));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТЗ.Сортировать("ЭтоГруппа Убыв,Уровень Убыв");
	
	// очищаем дерево
	КонтактныеЛица.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	
	Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
	Нстр.Ссылка = Контрагент;
	Нстр.ЭтоКорень = Истина;
	Нстр.ЭтоГруппа = Истина;
	Нстр.Представление = Строка(Нстр.Ссылка);
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		_СформироватьВеткуДерева(Стр, ТЗ, Нстр);
		
	КонецЦикла; 
	// --- 
	КоличествоПодчиненных = 0;
	Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
		_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
	КонецЦикла; 
	ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")","");
	Нстр.Представление = Строка(Контрагент)+ПредставлениеКоличества;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОпределитьУровеньГруппы(Группа, СоответствиеУровней)
	// --- 
	
	Если (Группа.Родитель.Пустая()) Тогда
		
		УровеньРодителя = 0;
		
	Иначе
		
		УровеньРодителя = СоответствиеУровней.Получить(Группа.Родитель);
		Если (УровеньРодителя = Неопределено) Тогда
			УровеньРодителя = _ОпределитьУровеньГруппы(Группа.Родитель, СоответствиеУровней);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Возврат(1+УровеньРодителя);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьВеткуДерева(СтрокаТЗ, ТЗ, Родитель=Неопределено)
	// --- 
	
	Если (СтрокаТЗ.СтрокаСформирована) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если (Родитель = Неопределено) Тогда
		
		Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		Нстр = Родитель.ПолучитьЭлементы().Добавить();
		
	КонецЕсли; 
	
	Нстр.Ссылка = СтрокаТЗ.Ссылка;
	Нстр.ЭтоГруппа = СтрокаТЗ.ЭтоГруппа;
	СтрокаТЗ.СтрокаСформирована = Истина;
	Если (СтрокаТЗ.ЭтоГруппа) Тогда
		
		Нстр.ИндексКартинки = 0;
		// --- 
		Отбор = Новый Структура("Родитель",Нстр.Ссылка);
		ТаблицаПодчиненных = _сф.к_НайтиСтроки(ТЗ,Отбор);
		Для каждого СтрокаПодчиненного Из ТаблицаПодчиненных Цикл
			_СформироватьВеткуДерева(СтрокаПодчиненного, ТЗ, Нстр);
		КонецЦикла; 
		// --- 
		КоличествоПодчиненных = 0;
		Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
			_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
		КонецЦикла; 
		
		// --- 
		Нстр.КоличествоПодчиненных = КоличествоПодчиненных;
		ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")",""); 
		Нстр.Представление = СтрокаТЗ.Наименование + ПредставлениеКоличества;
		
	Иначе
		
		Нстр.ИндексКартинки = 1;
		Нстр.КоличествоПодчиненных = 1;
		// --- 
		Нстр.Представление = Строка(СтрокаТЗ.Ссылка);
		Нстр.Должность = СтрокаТЗ.Должность;
		Нстр.Неактивный = СтрокаТЗ.Неактивный;
		Нстр.Комментарий = СтрокаТЗ.Комментарий;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура КонтактныеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Стр = КонтактныеЛица.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если (НЕ Стр.ЭтоГруппа) Тогда
		ОповеститьОВыборе(Стр.Ссылка);
	Иначе
		//_УФК.ВывестиПредупреждение("");
		СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если (НЕ ЗначениеЗаполнено(Контрагент)) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработатьВыборКонтрагента",ЭтотОбъект, Новый Структура()); 
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКонтрагента(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Контрагент = Ответ;
		_СформироватьДерево();
		
	КонецЕсли; 	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			Родитель = Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка;
		Иначе
			Родитель = Неопределено;
		КонецЕсли; 
	Иначе
		Родитель = Неопределено;
	КонецЕсли; 
	
	Если (Группа) Тогда
		ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель", Новый Структура("Владелец,Родитель", Контрагент, Родитель), Ложь, Родитель);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаГруппы", ПФ, Элемент);
	Иначе
		ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель", Новый Структура("Владелец,Родитель", Контрагент, Родитель), Ложь, Родитель);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаОбъекта", ПФ, Элемент);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоКорень) Тогда
			Возврат;
		КонецЕсли; 
		ПФ = Новый Структура("Ключ", Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка);
		Если (НЕ Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
 			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаЭлемента", ПФ, Элемент);
		Иначе
			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаГруппы", ПФ, Элемент);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуКонтактныхЛиц(Команда)
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			Родитель = Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка;
		Иначе
			Родитель = Неопределено;
		КонецЕсли; 
	Иначе
		Родитель = Неопределено;
	КонецЕсли; 
	
	ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель", Новый Структура("Владелец,Родитель", Контрагент, Родитель), Истина, Родитель);
	ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаГруппы", ПФ, Элементы.КонтактныеЛица);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоКорень) Тогда
			Возврат;
		Иначе
			УдалитьСтрокуКонтактныхЛиц();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуКонтактныхЛиц()
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		ТребуетсяПодтверждение = Ложь;
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			Если (Элементы.КонтактныеЛица.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0) Тогда
				ТребуетсяПодтверждение = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если (ТребуетсяПодтверждение) Тогда
			ПОВ = Новый ОписаниеОповещения("ВыполнитьУдалениеКонтактногоЛица", ЭтотОбъект, Новый Структура());
			ПоказатьВопрос(ПОВ,"Удалить группу контактных лиц?",РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьУдалениеКонтактногоЛица(КодВозвратаДиалога.Да,Неопределено);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеКонтактногоЛица(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		РезультатУдаления = _ВыполнитьУдалениеКонтактногоЛица(Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка);
		Если (_УФКС.ВыполненоУспешно(РезультатУдаления)) Тогда
			ТекущийУзел = Неопределено;
			СформироватьДерево();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ВыполнитьУдалениеКонтактногоЛица(Ссылка)
	
	Попытка
		Если (Ссылка.ЭтоГруппа) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_КонтактыеЛица.Ссылка
			               |ИЗ
			               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
			               |ГДЕ
			               |	CW_КонтактыеЛица.Родитель = &Родитель";
			Запрос.УстановитьПараметр("Родитель", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			Для каждого Стр Из ТЗ Цикл
				Ответ = _ВыполнитьУдалениеКонтактногоЛица(Стр.Ссылка);
				Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
					Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
					Возврат(Ответ);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Истина);
		Об = Ссылка.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущийУзел = НовыйОбъект;
	СформироватьДерево();	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	ПараметрыПеретаскивания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПараметрыПеретаскивания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если (ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")) Тогда
		ПеретаскиваемаяСтрока = ПараметрыПеретаскивания.Значение[0];
		Если (ТипЗнч(ПеретаскиваемаяСтрока) = Тип("Число")) Тогда
			_УстановитьРодителя(ПеретаскиваемаяСтрока, Строка);
			СформироватьДерево();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьРодителя(ИдентификаторЭлемента, ИдентификаторГруппы)
	
	СтрокаЭлемента = КонтактныеЛица.НайтиПоИдентификатору(ИдентификаторЭлемента);
	СтрокаГруппы = КонтактныеЛица.НайтиПоИдентификатору(ИдентификаторГруппы);
	
	ТекущийУзел = СтрокаЭлемента.Ссылка;
	ТекущийРодительУзла = СтрокаГруппы.Ссылка;
	
	Если (СтрокаГруппы.ЭтоГруппа) Тогда
		Элемент = СтрокаЭлемента.Ссылка.ПолучитьОбъект();
		Элемент.Родитель = СтрокаГруппы.Ссылка;
		Элемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаРазвернуть(Команда)
	
	Элементы.КонтактныеЛица.Развернуть(КонтактныеЛица.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаСвернуть(Команда)
	
	КорневаяСтрока = КонтактныеЛица.ПолучитьЭлементы()[0];
	Для Каждого СтрокаДерева Из КорневаяСтрока.ПолучитьЭлементы() Цикл
		Элементы.КонтактныеЛица.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры
 
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбновитьКонтактныхЛиц(Команда)
	
	СформироватьДерево();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СохранитьВидДерева()
	
	СостояниеДерева.Очистить();
	КореньДерева = Неопределено;
	СтрокиДерева = КонтактныеЛица.ПолучитьЭлементы();
	Если (СтрокиДерева.Количество() <> 0) Тогда
		ОпределитьСтатусУзла(СтрокиДерева[0]);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьСтатусУзла(Узел)
	
	Если (Узел.ЭтоГруппа) Тогда
		Идентификатор = Узел.ПолучитьИдентификатор();
		Если (Идентификатор <> Неопределено) Тогда
			Развернут = Элементы.КонтактныеЛица.Развернут(Идентификатор);
			Если (Развернут <> Неопределено) Тогда
				СостояниеДерева.Добавить(Узел.Ссылка,,Развернут);
				Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
					ОпределитьСтатусУзла(ПУ);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции
  
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВосстановитьВидДерева()
	
	ИдентификаторТекущегоУзла = 0;
	Если (СостояниеДерева.Количество() <> 0) Тогда
		СтрокиДерева = КонтактныеЛица.ПолучитьЭлементы();
		Если (СтрокиДерева.Количество() <> 0) Тогда
			ВосстановитьСтатусУзла(СтрокиДерева[0]);
		КонецЕсли; 
	КонецЕсли; 
	Элементы.КонтактныеЛица.ТекущаяСтрока = ИдентификаторТекущегоУзла;
	
КонецПроцедуры

&НаКлиенте
Функция ВосстановитьСтатусУзла(Узел)
	
	Если (Узел.ЭтоГруппа) Тогда
		СсылкаУзла = Узел.Ссылка;
		ЗаписьСтатуса = СостояниеДерева.НайтиПоЗначению(СсылкаУзла);
		Если (ЗаписьСтатуса <> Неопределено) Тогда
			ТекущийИдентификатор = Узел.ПолучитьИдентификатор();
			Если (ЗаписьСтатуса.Пометка) Тогда
				Элементы.КонтактныеЛица.Развернуть(ТекущийИдентификатор);
			КонецЕсли; 
			
			Если (СсылкаУзла = ТекущийРодительУзла ИЛИ СсылкаУзла = ТекущийУзел) Тогда
				ИдентификаторТекущегоУзла = ТекущийИдентификатор;
			КонецЕсли; 
		Иначе
			Элементы.КонтактныеЛица.Развернуть(Узел.ПолучитьИдентификатор());
		КонецЕсли; 
		
		Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
			ВосстановитьСтатусУзла(ПУ);
		КонецЦикла; 
	Иначе
		СсылкаУзла = Узел.Ссылка;
		Если (СсылкаУзла = ТекущийУзел) Тогда
			ТекущийИдентификатор = Узел.ПолучитьИдентификатор();
			ИдентификаторТекущегоУзла = ТекущийИдентификатор;
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции

// ----------------------------------------------------------------------------
